Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཡངས་པ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཡངས་པ་ཅན་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཞེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་རྣམས་དང་ཐབས་ཅིག་ཏུ་སང་བདག་ཅག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Thereupon the brahmins and householders in Vaiśālī left Vaiśālī and went to the Blessed One. . . . “May the Blessed One together with the community of monks assent to our offer of a meal at our house tomorrow.”

source: གནས་འཇོག་གི་བུ་དག་ང་སྔར་ཁྱིམ་བདག་ནོར་ཅན་གྱིས་སྤྱན་དྲངས་ཟིན་ཏོ། །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “Vāsiṣṭhas, I have already been invited by the householder Dhanika,” the Blessed One responded.

source: ཤེས་ལྡན་དག་ཁྱིམ་བདག་ནོར་ཅན་གྱིས་ནི་ཚོགས་ཀྱི་ཁྲིམས་བཅས་པ་ལས་འདས་པར་བྱས་སོ།
en: “Sirs,” they said to one another, “the householder Dhanika broke the agreement of our group.”

source: །ཁ་ཅིག་དག་གིས་སྨྲས་པ། ཅི་སྟེ་དེ་འདས་པར་བྱེད།
en: Some replied, “How could he break the agreement?

source: གདོན་མི་ཟ་བར་དེས་ཁྲིམས་བཅས་པ་མ་ཐོས་སོ།
en: Certainly, he must not have heard of the agreement.

source: །འོན་ཀྱང་བདག་ཅག་པས་དེ་ནི་སྐྱེས་བུ་དམ་པ་ཡིན་པས་གདུགས་ཚོད་གསོལ་དུ་ཆུག་བདག་ཅག་གིས་ནི་གནངས་གདུགས་ཚོད་གསོལ་ལོ།
en: Anyway, he is a more virtuous man than we, so let’s allow him to offer a meal. We will offer a meal the day after tomorrow.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནང་པར་སྔར་ལངས་ཏེ། ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ནས། ཁྱིམ་བདག་ནོར་ཅན་གྱི་ཁྱིམ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཤར་སྒོ་ནས་ཞུགས་པ་དང་། ཇི་ཙམ་ན་གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་རྣམས་སྟ་གོན་མ་བྱས་པ་མཐོང་ནས།
en: Thereupon the venerable Ānanda rose early in the morning, took his bowl and his robe, and went to the house of the householder Dhanika. When he arrived, he entered through the eastern gate but saw no seat arranged and no food prepared.

source: དེ་ནས་ཁྱིམ་བདག་ནོར་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱིམ་བདག་ཁྱོད་ཀྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་སྤྱན་དྲངས་ནས་སྙིང་ལས་ཆུང་ངུས་གནས་སམ།
en: He asked the householder Dhanika, “O householder, are you unconcerned, having invited the community of monks headed by the Buddha?”

source: དེས་སྨྲས་པ། འཕགས་པ་ཀུན་དགའ་བོ་ཅི་སྟེ་དེ་སྐད་གསུང་།
en: “O noble one, Ānanda, why do you say so?” he replied.

source: ཁྱིམ་བདག་གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་རྣམས་སྟ་གོན་མ་བྱས་པ་མཐོང་ངོ་།
en: “O householder, I saw no seat arranged and no food prepared.”

source: །འཕགས་པ་ཁྱོད་ཆབ་སྒོ་གང་ནས་ཞུགས་ཁྱིམ་བདག་ཤར་ནས་སོ།
en: “Through which gate did you enter, noble one?” “O householder, I entered through the eastern one.”

source: །འཕགས་པ་ལྷོ་ནས་ཞུགས་ཤིག །དེས་ཞུགས་པ་ལས་ཇི་ཙམ་ན་ལྷའི་གདན་བཤམས་ཤིང་ལྷའི་ཞལ་ཟས་རྣམས་སྟ་གོན་བྱས་པ་ཡང་མཐོང་ངོ་།
en: “O noble one, enter through the southern one.” He entered there and saw divine seats arranged and divine foods prepared.

source: །མཐོང་ནས་ཀྱང་ཤིན་ཏུ་ངོ་མཚར་སྐྱེས་པར་གྱུར་ཏོ།
en: When he saw all that, he felt great wonder.

source: །དེ་ནས་ཁྱིམ་བདག་ནོར་ཅན་གྱི་སྤྱན་འདྲེན་གྱིས་བཅོམ་ལྡན་འདས་ལ་དུས་ཚོད་གསོལ་པ།
en: Thereupon the householder Dhanika’s messenger let the Blessed One know the time:

source: བཙུན་པ་གདུགས་ཚོད་བཤམས་ལགས་ཤིང་མཆིས་ན། བཅོམ་ལྡན་འདས་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛད་དུ་གསོལ་ཞེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས། སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Honored One, the time has arrived. May the Blessed One know that the meal is ready.” . . . Knowing the Blessed One had finished his meal and washed his hands and his bowl, he took a low seat and sat before the Blessed One to hear the Dharma.

source: །དེ་ནས་ནོར་ཅན་གྱི་ཆུང་མ་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་རྣམས་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Thereupon Dhanika’s wife rose from her seat, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of a meal at our house tomorrow.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་ནོར་ཅན་གྱི་ཆུང་མ་ལ་གནང་ངོ་།
en: The Blessed One assented to Dhanika’s wife by remaining silent.

source: །གནང་ནས་ཀྱང་ཁྱིམ་བདག་ནོར་ཅན་ལ་ཆོས་བཤད་པ་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ།
en: Having assented, he preached the Dharma to the householder Dhanika, rose from his seat, and departed.

source: །ནོར་ཅན་གྱི་ཆུང་མས་ཀྱང་ཞལ་ཟས་རྣམས་སྟ་གོན་བྱས་སོ།
en: Dhanika’s wife also prepared food.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནང་པར་སྔར་ལངས་ཏེ་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ནས་ཁྱིམ་བདག་ནོར་ཅན་གྱི་ཁྱིམ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ལྷོ་སྒོ་ནས་ཞུགས་ན་གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་རྣམས་ཀྱང་སྟ་གོན་མ་བྱས་པར་མཐོང་ངོ་།
en: Thereupon the venerable Ānanda rose early in the morning, took his bowl and his robe, and went to the house of the householder Dhanika. When arrived, he entered through the southern gate but saw no seat arranged and no food prepared.

source: །མཐོང་ནས་ཀྱང་ནོར་ཅན་གྱི་ཆུང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱིམ་བདག་གི་ཆུང་མ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ནས་ཅི་སྙིང་ལས་ཆུང་ངུས་གནས་སམ་དེས་སྨྲས་པ།
en: When he saw this, he asked Dhanika’s wife, “O householder’s wife, are you unconcerned, having invited the community of monks headed by the Buddha?”

source: འཕགས་པ་ཅི་སྟེ་དེ་སྐད་གསུང་གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་རྣམས་ཀྱང་སྟ་གོན་མ་བྱས་པ་མཐོང་ངོ་།
en: “O noble one, Ānanda, why do you say so?” she replied. “I saw no seat arranged and no food prepared.”

source: །འཕགས་པ་ཁྱོད་ཆབ་སྒོ་གང་ནས་ཞུགས་ལྷོ་ནས་སོ།
en: “Through which gate did you enter, noble one?” “Through the southern one.”

source: །འཕགས་པ་ཤར་ནས་ཞུགས་ཤིག །ཇི་ཙམ་ན་གདན་བཟང་པོ་བཤམས་ཤིང་ཞལ་ཟས་བསོད་པ་སྟ་གོན་བྱས་པ་ཡང་མཐོང་ངོ་།
en: “O noble one, enter through the eastern one.” When he did so, he saw beautiful seats arranged and delicious food prepared.

source: །དེ་ནས་ནོར་ཅན་གྱི་ཆུང་མའི་སྤྱན་འདྲེན་གྱིས་བཅོམ་ལྡན་འདས་ལ་དུས་ཚོད་གསོལ་པ།
en: Thereupon Dhanika’s wife’s messenger let the Blessed One know the time:

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གདུགས་ཚོད་བཤམས་ལགས་ཤིང་མཆིས་ན། བཅོམ་ལྡན་འདས་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛད་དུ་གསོལ་ཞེས་བྱ་བ་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས། སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Honored One, the time has arrived. May the Blessed One know that the meal is ready.” . . . Knowing the Blessed One had finished his meal and washed his hands and his bowl, she took a low seat and sat before the Blessed One to hear the Dharma.

source: །དེ་ནས་ནོར་ཅན་གྱི་བུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Thereupon Dhanika’s son rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་ནོར་ཅན་གྱི་བུ་ལ་གནང་ངོ་།
en: The Blessed One assented to Dhanika’s son by remaining silent.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ནོར་ཅན་གྱི་ཆུང་མ་ལ་ཆོས་བཤད་པ་མཛད་ནས་གཤེགས་སོ།
en: Then he preached the Dharma to Dhanika’s wife and departed.

source: །ནོར་ཅན་གྱི་བུས་ཀྱང་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་བྱས་སོ།
en: Dhanika’s son also prepared a pure and fine meal.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནང་པར་སྔར་ལངས་ཏེ་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ་ནོར་ཅན་གྱི་ཁྱིམ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ལྷོ་སྒོ་ནས་ཞུགས་ན་གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་སྟ་གོན་མ་བྱས་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ནོར་ཅན་གྱི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the venerable Ānanda rose early in the morning, took his bowl and his robe, and went to the house of the householder Dhanika. Having arrived, he entered through the southern gate but saw no seat arranged and no food prepared.

source: །ཁྱིམ་བདག་གི་བུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་ནས་ཅི་སྙིང་ལས་ཆུང་ངུས་གནས་སམ།
en: He asked Dhanika’s son, “O householder’s son, are you unconcerned, having invited the community of monks headed by the Buddha?”

source: དེས་སྨྲས་པ། འཕགས་པ་ཇི་སྟེ་དེ་སྐད་གསུང་།
en: “O noble one, Ānanda, why do you say so?” he replied.

source: གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་སྟ་གོན་མ་བྱས་པ་མཐོང་ངོ་།
en: “I saw no seat arranged and no food prepared.”

source: །འཕགས་པ་ནུབ་ནས་ཞུགས་ཤིག །ཇི་ཙམ་ན་གདན་བཟང་པོ་བཤམས་ཤིང་ཞལ་ཟས་བསོད་པ་སྟ་གོན་བྱས་པ་ཡང་མཐོང་ངོ་།
en: “O noble one, enter through the western one.” When he did so, he saw beautiful seats arranged and delicious food prepared.

source: །དེ་ནས་ནོར་ཅན་གྱི་བུའི་སྤྱན་འདྲེན་གྱིས་བཅོམ་ལྡན་འདས་ལ་དུས་ཚོད་གསོལ་པ།
en: Thereupon Dhanika’s son’s messenger let the Blessed One know the time:

source: བཙུན་པ་གདུགས་ཚོད་བཤམས་ལགས་ཤིང་མཆིས་ན་བཅོམ་ལྡན་འདས་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛད་དུ་གསོལ་ཞེས་བྱ་བ་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས། སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Honored One, the time has arrived. May the Blessed One know that the meal is ready.” . . . Knowing the Blessed One had finished his meal and washed his hands and his bowl, he took a low seat and sat before the Blessed One to hear the Dharma.

source: །དེ་ནས་ནོར་ཅན་གྱི་མནའ་མ་སྟན་ལས་ལངས་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Thereupon Dhanika’s daughter-in-law rose from her seat, made the gesture of supplication to the Blessed One, and said to the Blessed One, “May the Blessed One together with the community of monks assent to my offer of a meal at my house tomorrow.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་ནོར་ཅན་གྱི་མནའ་མ་ལ་གནང་ངོ་།
en: The Blessed One assented to Dhanika’s daughter-in-law by remaining silent.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ནོར་ཅན་གྱི་བུ་ལ་ཆོས་བཤད་པ་མཛད་ནས་གཤེགས་སོ།
en: Then he preached the Dharma to Dhanika’s son and departed.

source: །དེ་ནས་ཡངས་པ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Thereupon the brahmins and householders in Vaiśālī went to the Blessed One. When they arrived, they bowed low until their foreheads touched the Blessed One’s feet, and then sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཞེས་བྱ་བ་ནས་ཅང་མི་གསུང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When they had sat down, the Blessed One, through talk consistent with the Dharma, . . . delighted the brahmins and householders in Vaiśālī and then remained silent.

source: །དེ་ནས་ཡངས་པ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་ཅག་གི་སྡུམ་པར་གདུགས་ཚོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then the brahmins and householders in Vaiśālī rose from their seats, draped their upper robes over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “May the Blessed One together with the community of monks assent to our offer of a meal at our house tomorrow.”

source: གནས་འཇོག་གི་བུ་དག་ང་སྔར་ནོར་ཅན་གྱི་མནའ་མས་སྤྱན་དྲངས་ཟིན་ཏོ།
en: “Vāsiṣṭhas,” the Blessed One responded, “I have already been invited by Dhanika’s daughter-in-law.”

source: །དེ་ནས་ཡངས་པ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་རྔམ་ནས་སྨྲས་པ།
en: Then the brahmins and householders in Vaiśālī became furious and shouted, “Sirs, is Dhanika the only one who has wealth?

source: ཤེས་ལྡན་དག་ནོར་ཅན་གཅིག་པུ་ལ་ནོར་ཡོད་ཀྱི་བདག་ཅག་ལ་མེད་དམ་ཅི་ན།
en: Do we not have any wealth?

source: དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཉི་མ་རེ་རེ་གདུགས་ཚོད་སྦྱོར་ཞིང་བདག་ཅག་ཁོ་ནས་སྐབས་མ་ཐོབ་པར་གྱུར་ཏོ།
en: Since he prepares a meal for the community of monks headed by the Buddha every day, we do not have any opportunity to do so.

source: །དེ་ལ་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: What should we do about this?”

source: གཞན་དག་གིས་སྨྲས་པ། གང་གི་ཚེ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་ཟིན་ནས་གཤེགས་པར་གྱུར་པ་དེའི་ཚེ་དེའི་ཁྱིམ་རྡོ་བ་རེ་རེ་ནས་བཀོགས་ཏེ་གཞིག་གོ།
en: Some of them urged, “Let us destroy his house, pulling out every stone from it, after the community of monks headed by the Buddha has finished its meal and left.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ནང་པར་སྔར་ལངས་ཏེ་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ནས་ཁྱིམ་བདག་ནོར་ཅན་གྱི་ཁྱིམ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ནུབ་སྒོ་ནས་ཞུགས་ན་གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་ཀྱང་སྟ་གོན་མ་བྱས་པ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ནོར་ཅན་གྱི་མནའ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the venerable Ānanda rose early in the morning, took his bowl and his robe, and went to the house of the householder Dhanika. When he arrived, he entered through the western gate but saw no seat arranged and no food prepared.

source: །ནོར་ཅན་གྱི་མནའ་མ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་སྤྱན་དྲངས་ནས་ཅི་སྙིང་ལས་ཆུང་ངུས་གནས་སམ།
en: He asked Dhanika’s daughter-in-law, “O Dhanika’s daughter-in-law, are you unconcerned, having invited the community of monks headed by the Buddha?”

source: དེས་སྨྲས་པ། འཕགས་པ་ཅི་སྟེ་དེ་སྐད་གསུང་།
en: “O noble one, Ānanda, why do you say so?” she replied.

source: གདན་མ་བཤམས་ཤིང་ཞལ་ཟས་རྣམས་ཀྱང་སྟ་གོན་མ་བྱས་པ་མཐོང་ངོ་།
en: “I saw no seat arranged and no food prepared.”

source: །འཕགས་པ་ཆབ་སྒོ་གང་ནས་ཞུགས་ནུབ་ནས་སོ།
en: “Through which gate did you enter, noble one?” “Through the western one.”

source: །འཕགས་པ་བྱང་ནས་ཞུགས་ཤིག །དེས་བྱང་ནས་ཞུགས་ན་ཇི་ཙམ་ན་ལྷའི་གདན་བཤམས་ཤིང་ལྷའི་ཞལ་ཟས་སྟ་གོན་བྱས་པ་མཐོང་ངོ་།
en: “O noble one, enter through the northern one.” He entered through the northern gate and saw divine seats arranged and divine foods prepared.

source: །དེ་ནས་ནོར་ཅན་གྱི་མནའ་མའི་སྤྱན་འདྲེན་གྱིས་བཅོམ་ལྡན་འདས་ལ་དུས་ཚོད་གསོལ་པ།
en: Thereupon Dhanika’s daughter-in-law’s messenger let the Blessed One know the time:

source: བཙུན་པ་གདུགས་ཚོད་བཤམས་ལགས་ཤིང་མཆིས་ན་བཅོམ་ལྡན་འདས་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛད་དུ་གསོལ་ཞེས་བྱ་བ་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Honored One, the time has arrived. May the Blessed One know that the meal is ready.” The Blessed One . . . sat on the seat prepared for him in front of the community of monks.

source: །དེ་ནས་ཡངས་པ་ཅན་གྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་ཐམས་ཅད་འདུས་ནས་ཁྱིམ་བདག་ནོར་ཅན་གྱི་སྒོ་ན་འདུག་གོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་ནོར་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Thereupon the brahmins and householders in Vaiśālī met together and stood at the gate of Dhanika’s house.

source: །ཁྱིམ་བདག་ཡངས་པ་ཅན་གྱི་ཚོགས་རྔམ་ནས་སྒོ་ན་འདུག་སྟེ་དེ་དག་གིས་ཁྱེད་ཅག་ལ་གནོད་པ་བྱས་པར་འགྱུར་དུ་འོང་གིས་སོང་ལ་བཟོད་པར་གསོལ་ཅིག །དེ་ཕྱིར་བྱུང་ནས་བཟོད་པར་གསོལ་བར་བརྩམས་པ་དང་དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The Blessed One said to the householder Dhanika, “Householder, an angry mob of people from Vaiśālī is standing at the gate. As they have come to harm you, you should go and ask their pardon.”

source: ཁྱིམ་བདག་ཅི་ཁྱོད་གཅིག་པུ་ལ་ནོར་ཡོད་དམ།
en: When he went out to ask their pardon, they complained to him, “O householder, are you the only person who has wealth?

source: གང་གི་ཕྱིར་ཁྱོད་ཀྱིས་ཉིན་རེ་ཞིང་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་ཏེ་ཁོ་བོ་ཅག་གིས་སྐབས་མི་རྙེད་པར་བྱེད། དེས་སྨྲས་པ།
en: Since you offer a meal to the community of monks headed by the Buddha every day, we do not have any opportunity to do so.”

source: ཤེས་ལྡན་དག་བདག་གིས་ཚོགས་ཀྱི་ཁྲིམས་སུ་བཅས་པ་མ་ཐོས་ཀྱིས། དེ་བས་ན་ཚོགས་ཀྱིས་བཟོད་པར་བྱ་བའི་རིགས་སོ། །གཞན་དག་གིས་སྨྲས་པ།
en: “Sirs,” he answered, “since I did not heard about any agreement made by the group, it would be reasonable for this crowd of people to pardon me.”

source: ཤེས་ལྡན་དག་སྐྱེས་བུ་འདི་ནི་དམ་པ་ཡིན་པས་འདི་ལ་བཟོད་པར་བྱའོ་ཞེས་དེ་རྣམས་བཟོད་པར་གྱུར་པ་དང་། དེས་སྨྲས་པ།
en: Some of them said, “Sirs, as this is the foremost person, we should pardon him.”

source: གལ་ཏེ་དེ་ལྟ་ན་ནང་དུ་ཞུགས་ཤིག་དེ་རྣམས་ཁྱིམ་དུ་ཞུགས་པ་དང་། གདན་བཟང་པོ་བཤམས་ཤིང་ཞལ་ཟས་བསོད་པ་སྟ་གོན་བྱས་པ་ཡང་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཤིན་ཏུ་ངོ་མཚར་སྐྱེས་པར་གྱུར་ནས་སྨྲས་པ། ཁྱིམ་བདག་ཁྱོད་འབའ་ཞིག་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་གདུགས་ཚོད་གསོལ་བར་འོས་ཀྱི།
en: And so they did pardon him. He then said to them, “Please come in.” When they entered the house and saw beautiful seats arranged and delicious food prepared, they felt great wonder and said, “O householder, you are the only one qualified to offer a meal to the community of monks headed by the Buddha.

source: ཁོ་བོ་ཅག་ནི་མ་ཡིན་ནོ།
en: We are not.”

source: །དེས་དེ་རྣམས་ལ་རིན་པོ་ཆེ་དག་བྱིན་པ་དང་དེ་རྣམས་ཀྱིས་མ་བླངས་སོ།
en: He gave them jewels, but they did not accept them.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་དང་། རིན་པོ་ཆེ་འདི་དག་ནི་རྙེད་པར་དཀའ་བ་ཡིན་གྱིས་ལོང་ཤིག །དེ་རྣམས་ཀྱིས་བླངས་པ་ལས་གང་གིས་ཅི་འདྲ་བ་བླངས་པ་དེའི་ཁ་དོག་དེ་འདྲ་བ་ཁོ་ནར་སྣང་བར་གྱུར་ཏོ།
en: The Blessed One said, “Accept them, as these jewels are hard to obtain.” Then they did accept them, and each person’s face shone in the color of what he had accepted.

source: །དེ་ནས་ནོར་ཅན་གྱི་མནའ་མས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས། གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་གིས་ཞེས་བྱ་བ་ནས་ཕྱག་བཅབས་ཏེ།
en: Thereupon Dhanika’s daughter-in-law knew that the community of monks headed by the Buddha had sat down in comfort, and she served and satisfied them with a pure and fine meal . . . .

source: ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་ཆེས་དམའ་བ་ཞིག་བླངས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Knowing the Blessed One had . . . washed his hands and his bowl, she took a low seat and sat before the Blessed One in order to hear the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ནོར་ཅན་དང་། ནོར་ཅན་གྱི་ཆུང་མ་དང་། ནོར་ཅན་གྱི་བུ་དང་། ནོར་ཅན་གྱི་མནའ་མ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་གང་ཐོས་ན་ནོར་ཅན་དང་། ནོར་ཅན་གྱི་ཆུང་མ་དང་། ནོར་ཅན་གྱི་བུ་དང་། ནོར་ཅན་གྱི་མནའ་མ་རྣམས་ཀྱིས་འཇིག་ཚོགས་ལ་ལྟ་བ་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་སྟེ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་པ་དེ་ལྟ་བུར་འཕགས་པའི་བདེན་པ་རྣམས་སོ་སོར་རྟོགས་པར་བྱེད་པའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew the thinking, proclivity, disposition, and nature of Dhanika and his wife, son, and daughter-in-law, and preached the Dharma that was appropriate for them and that caused them to penetrate the four truths of the noble ones. Upon hearing it, Dhanika and his wife, son, and daughter-in-law leveled the twenty high peaks of the mountain chain of the false view of individuality with the vajra of knowledge and actualized the fruit of stream-entry.

source: དེ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་ནས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པས་ཆེད་དུ་བརྗོད་པ་ཞེས་བྱ་བ་ནས།
en: Having seen the truths, they spoke an inspired utterance three times:

source: བདག་ཅག་ནི་མངོན་པར་འཕགས་སོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “. . . We have been truly exalted.

source: །བདག་ཅག་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since we seek refuge in the Blessed One, the Dharma, and the community of monks, may you accept us as lay followers.

source: ཇི་སྲིད་འཚོ་བའི་བར་དུ་སྲོག་དང་ཡང་བསྡོས་ཏེ་སྐྱབས་སུ་མཆི་བར་མངོན་པར་དད་ལགས་སོ།
en: From today onward, we embrace our faith as ones who seek refuge throughout our lives.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ནོར་ཅན་དང་། ནོར་ཅན་གྱི་ཆུང་མ་དང་། ནོར་ཅན་གྱི་བུ་དང་། ནོར་ཅན་གྱི་མནའ་མ་རྣམས་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ།། །།འདུལ་བ་གཞི།
en: Then the Blessed One, having instructed, inspired, encouraged, and delighted Dhanika and his wife, son, and daughter-in-law through talk consistent with the Dharma, rose from his seat and departed. B.

source: བམ་པོ་ལྔ་བཅུ་བདུན་པ།
en: The Former Lives of Dhanika and His Family

source: དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་བཙུན་པ་ནོར་ཅན་དང་། ནོར་ཅན་གྱི་མཆིས་འབྲང་དང་། ནོར་ཅན་གྱི་བུ་དང་། ནོར་ཅན་གྱི་མནའ་མ་རྣམས་ཀྱིས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཤིང་ལྷ་དང་མི་རྣམས་ཀྱི་དཔལ་ཉམས་སུ་མྱོང་བར་གྱུར་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “Honored One, what karma did Dhanika and his wife, son, and daughter-in-law create that matured to cause them, after having been born into a family that is rich and has great wealth and many possessions, to experience divine and human prosperity?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་རྣམས་ཁོ་ནས་ལས་རྣམས་བྱས་ཤིང་བསགས་པ་ཚོགས་རྙེད་པ་ཞེས་བྱ་བ་ནས།
en: “Monks,” the Blessed One replied, “the actions were performed and accumulated by them, accruing a heap of karma . . . . “. . .

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བཱ་རཱ་ཎ་སཱི་ན་མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་ཞིག་ཡོད་པ་དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ཏེ།
en: “Monks, once there lived a garland maker in Vārāṇasī.

source: དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད་དགའ་བར་བྱེད་དགའ་མགུར་སྤྱོད་པར་བྱེད་དོ། །དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད།
en: He took a wife from a family of equal rank, and he and she played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ལས་ཁྱེའུ་ཞིག་བཙས་སོ།
en: Thus, a son was born.

source: །དེས་དེ་ཡང་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་སོ།
en: He arranged for a wife for the son, too, from a family that was equal to his.

source: །དེ་དུས་ཕྱི་ཞིག་ན་བཀྲེན་ཞིང་ཤིན་ཏུ་བཀྲེན་པར་གྱུར་ཏེ།
en: “Later, he became very poor.

source: དེ་དང་། བུ་དང་། ཆུང་མ་དང་། མནའ་མས་བརྩོན་པ་ཆེན་པོས་འབད་པས་རས་ཡུག་གཅིག་ཅིག་གྲུབ་ནས།
en: He and his son, wife, and daughter-in-law obtained a sheet of cloth with great effort.

source: དེ་ནས་མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་ཡང་དེ་བགོས་ནས།
en: Then, wearing it, the garland maker offered flowers to a king.

source: རྒྱལ་པོ་ལ་མེ་ཏོག་འབུལ་མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་གྱི་ཆུང་མ་ཡང་དེ་ཉིད་བགོས་ནས་བཙུན་མོ་ལ་འབུལ།
en: The garland maker’s wife also offered flowers to the queens, wearing the same cloth.

source: མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་གྱི་བུ་ཡང་དེ་ཉིད་བགོས་ནས་གཞོན་ནུ་རྣམས་ལ་འབུལ།
en: The garland maker’s son also offered flowers to the princes, wearing the same cloth.

source: མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་གྱི་མནའ་མ་ཡང་དེ་ཉིད་བགོས་ནས་རྒྱལ་པོའི་མནའ་མ་རྣམས་ལ་མེ་ཏོག་ཕྲེང་འབུལ་བར་བྱེད་དོ།
en: The garland maker’s daughter-in-law also offered flowers to the king’s daughters-in-law, wearing the same cloth.

source: །སངས་རྒྱས་རྣམས་འབྱུང་བ་མེད་པ་ན་འཇིག་རྟེན་དུ་རང་སངས་རྒྱས་དམན་པ་དང་། ངན་པ་ལ་སྙིང་བརྩེ་བ་དང་། གནས་མལ་བས་མཐའ་ལ་བརྟེན་པ།
en: “When the buddhas do not appear, there appear self-awakened ones as the only fields of merit in the world, who are compassionate toward inferior, wretched people and content with places to sit in the outskirts of towns.

source: འཇིག་རྟེན་གྱི་ཡོན་གནས་གཅིག་པུ་དག་འབྱུང་བར་འགྱུར་བས་ཇི་ཙམ་ན་རང་སངས་རྒྱས་ཤིག་ལྗོངས་རྒྱུ་ཞིང་འགྲོ་བ་ན་ཉི་མ་ནུབ་ཀའི་དུས་སུ་བཱ་རཱ་ཎ་སཱིར་ཕྱིན་ནས་མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་དེའི་ཁྱིམ་གྲོང་ཁྱེར་གྱི་སྒོ་ན་འདུག་པ་དེའི་ལྡུམ་རར་ནུབ་མོ་གནས་བཏབ་སྟེ་མེའི་ཁམས་ལ་སྙོམས་པར་ཞུགས་སོ།
en: “At that time a certain self-awakened one, traveling through the country, arrived at Vārāṇasī toward nightfall. He stayed at the garland maker’s house, which was near the entrance to the city, and spent the night in his household garden.

source: །དེ་ནས་མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་དེས་མེའི་ཕུང་པོ་འབར་བ་ལྟ་བུར་མཐོང་ནས་དེ་དད་པ་སྐྱེས་ཏེ་ཆུང་མ་ལ་སྨྲས་པ་དང་དེ་ཡང་དད་པར་གྱུར་ཏོ།
en: He meditated there on the element of fire, at which point the garland maker saw something like a mass of burning flames. Faith having arisen in him, he told his wife about this, and she also gained faith.

source: །དེས་བུ་ལ་སྨྲས་པ་དང་དེ་ཡང་དད་པར་གྱུར་ཏོ།
en: She told her son, and he also gained faith.
